<template>
  <v-container fluid>
    <v-slide-y-transition mode="out-in">
      <v-layout column align-center>
        <span>
          八角检测微信公众号项目开发方案-修订稿
界面整体布局分为3个主模块：八角年审、业务办理、便民服务。每个主模块下分若干子模块。(所有内容须包含新检测线)
主模块一：八角年审 ，下设4个子模块，具体如下：
   子模块1、关于我们：1）公司简介，业务内容介绍（年审、尾气、保险）。2）联系我们：常规注意事项简述（审车须准备的资料、设备、违章处理，免检车辆提醒等）。车检电话，微信号、以及其他联系方式。
   子模块2、服务特色
包含3部分内容：一是介绍“全程代办”，强调客户得到的便利；二是“您是上帝”罗列检车中客户常遇到的服务类问题，在我司是如何被解决的。（例如乱收费、插队、回访等）；三是年审提醒，告诉客户公司自主开发了客户系统并建立了客服团队，将在客户车辆到期时给予友善提醒。
子模块3、客户之声：客户可对车辆检测、业务办理流程、人员服务、公司环境及配套设施等进行评价。建立答复机制，明确专人负责、问题答复时间、不同问题由谁答复等。
子模块4、位置导航：可以点击打开地图，定位到八角车检的位置，并可实现自动导航。
主模块二：业务办理
  子模块1、登记注册：客户可注册，绑定车辆信息（重要）。并可查询绑定车辆的年审时间、年审费用等。
子模块2、年审预约
小型车年审预约： 点击进入后，填写联系人、电话、车牌号、预约日期及时间。可预约审车日期为周一到周日（不含法定节假日），每周预约截止时间为周五中午12点，每周五下午3点前后台管理人员统计预约车辆信息，提交给相关负责人，负责人根据预约情况安排工作。设定固定时间内的预约车辆数量限制，暂定为1小时内预约上限为25（可自行设置）辆，超过则弹出提醒并建议更换预约时间。（具体开放预约的日期、时间段及数量等都可以灵活设置）
大型车年审预约：同上
  新车挂牌预约：同上
预约功能说明：预约窗口借鉴如下形式，以客户填写简洁方便为开发依据，客户填写信息后，系统提供2个选择：一是网上缴费，点击后进一步填写车辆信息，系统自判断费用，客户缴纳费用。二是现场缴费，选择现场缴费则直接提交已填写的信息即可。
子模块3、违章查询：跳转到微信自带违章查询或关联到当地交警违章处理系统，实现客户可通过微信公众号查询并处理违章。（跳转到烟台公安公众号进行处理）
主模块三：便民服务
子模块1、行业资讯：检测行业及汽车行业相关资讯
  子模块2、检车流程：
免检车流程：介绍6年内免检车办理流程
  上线检测流程：介绍正常车辆检测流程
  新车挂牌流程：介绍新车挂牌流程
异地车流程：介绍异地车（省内外）办理流程
子模块3、八角商城：上架公司自有商品海参、允诚果蔬等，或车辆相关用品（自购或招加盟商）。做成微商城（微店）模式，当公众号关注用户达到一定量，该模块将成为重点运营模块，可吸纳一些车辆相关行业入住，并从收益中提成。（取消）

总结：建设微信公号的目的是提升企业知名度，黏住客户。实现目的的方式主要是通过微信公众号能够提供的便利和优惠政策。而未来公众号主要4个重要功能：预约、推广、客户信息收集、客户意见收集。
                         推广方案初稿
1、	来司审车客户，在大厅现场关注公众号优惠5元，分享朋友群再优惠5元。已关注公众号或分享朋友圈的，现场展示给工作人员看，享受同样优惠。
2、	寻找合作单位，现场摆放公众号宣传广告，合作单位可采取给予一定审车优惠政策的方式建立合作关系。（目前已合作的汽修厂、驾校等均可利用）
3、	花钱在一些大型停车场所，商场投放广告。
4、	使用公众号网上预约功能，并按预约时间检车的，单次优惠10元，该优惠与第一条不冲突。
5、	商城购物满1000送审车优惠券10元（具体根据商品利润）。
6、	家庭客户通过商城直接购买审车服务，可享受一定优惠。
7、	购买保险+审车套餐，可享受一定优惠。
8、	建设检测线无线网络，覆盖服务大厅及停车场。
9、	设立独立客户区，用于通过微信公众号购买服务的客户。
微信公众号项目计划安排
软件的开发周期1-2个月，具体计划：
1、3月份敲定方案、确定开发商（期间通过公司内部沟通、外部请教专业人士的方式逐步完善方案）；
2、4月15日开始开发，5月16完成；
3、5月20日前试运行，开发商修复BUG、完善系统；
4、6月份正式上线。
5、4月份确定推广方案并推广。宣传方面适当偏重新线。

3月28日会议确定内容简要
1、	微信预约以缴费为准，仅收集缴费客户信息。
2、	预约期限为10天一个周期，每天6个时间段，每个时间段的具体时间和预约数量可自行设置。没有预约的时间段可以关闭。 
3、	将填表工作改进为电脑打印，软件公司调整车辆信息登记窗口，实现可A4激光机直接打印。
4、	客户登记须填写车牌号和手机号，只能绑定一辆汽车，但预约时可填写其他车辆。
5、	客户预约时只需上传3张图片：行驶证正本、副本、较强保单。
6、	增加保险信息采集模块。
7、	2个站使用一个公众号，预约信息2个站都能看到，车辆可在任意一站进行车辆检测。但是数据统计时需要区分。
8、	微信端和PC端的数据实现互通。
9、	预约客户办理流程，预约成功后，客服人员录入信息打印表格，提交到外检区。客户到厂后直接进外检区进行验证检车，免去大厅登记-收费-登记手续。
10、	我发功能需求：1）我方需要的数据报表；2）统计报表中能否体现检车几次（待定）；3）实现老客户流失率的统计，例如15年来检车辆在16年是否来检，并实现预警功能，将工作做到前面。4）显示一辆车每次检测时间。
11、	注意事项：1）短信验证码需要花费费用，预计每条0.5元。微信服务号需要认证费用，开通付费费用；3）服务器费用。

        </span>
        <blockquote>
          &#8220;First, solve the problem. Then, write the code.&#8221;
          <footer>
            <small>
              <em>&mdash;John Johnson</em>
            </small>
          </footer>
        </blockquote>
      </v-layout>
    </v-slide-y-transition>
  </v-container>
</template>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
h1, h2 {
  font-weight: normal;
}
ul {
  list-style-type: none;
  padding: 0;
}
li {
  display: inline-block;
  margin: 0 10px;
}
a {
  color: #42b983;
}
</style>
